/// {@template di_base_repo}
/// Базовий міксин всім репозиторіїв у додатку.
///
/// Надає загальну функціональність всім репозиторіїв:
/// - Унікальне найменування репозиторію
/// - Базова структура для DI контейнера
///
/// Кожен репозиторій у додатку повинен використовувати цей міксин
/// для забезпечення сумісності із системою залежностей.
/// {@endtemplate}
mixin class DiBaseRepo {
  /// {@macro di_base_repo}
  DiBaseRepo();

  /// Найменування репозиторію для ідентифікації в DI контейнері
  String get name => 'DiBaseRepo';
}
